cnjack/jcode-buddy/sdkconfig.defaults
# ESP-IDF default configuration for 流光 Smart Desktop Companion
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# PSRAM (Octal, 80MHz)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# LVGL
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_TXT_BREAK_CHARS=" ,.;:-_"
CONFIG_LV_USE_SNAPSHOT=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# FAT filesystem
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_SECTOR_512=y

# Bluetooth — NimBLE (BLE-only, for NUS)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=247

# WiFi + BLE co-existence
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# Reduce WiFi buffers to share internal SRAM with BLE
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=3
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
# Static TX count reduced (each ~1.6KB internal SRAM; 16→4 saves ~19KB)
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=4
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=4
# RX management: dynamic
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUFFER=y
# Move WiFi/LwIP dynamic allocations to PSRAM
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# HTTP client
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
